ConnectorProfileTypeParamDefCombo
This class is used for displaying the connector's shape in a combo box.
We filter the shapes displayed based on the domain of the connector. For
example, Duct has round, rect, oval while Cabletray/Conduit has only round
and rect.